output/posts/post-qwa-post.org
#+BEGIN_COMMENT
.. title: Post-Q,W,A Post
.. date: 2008/03/23 12:17:00
.. tags: blab, fest, quark
.. slug: post-qwa-post
#+END_COMMENT




Back again with another khichdi of a post.

- Quark, Waves and Apogee. [For the uninitiated, Quark is our
  technical festival and Waves, our Cul-fest] I had been to
  BITS-Pilani, for attending their Tech-fest, Apogee.
    - One would expect Apogee to end up the best, but we were
      thoroughly disappointed. It came nowhere near the perfection
      of Quark and things seemed quite unprofessional. Hats-off to
      Chaitu n others in the Quark Org-Co. I'm already worried
      about missing Quark'09 [thanks to my PS]
    - The specials at all three events were unforgettable. Feeding
      the Fish, the Air Shows (Naval and Amateur planes), the
      Orchestral performance, Special Performance [Aasra], Sand
      art by Gagan and Mithali!
    - Had the opportunity, to meet/have a look at some of the guys
      studying at colleges in their home towns. For once, I felt
      being in a "reputed", national college does matter.
    - Felt good spending some time with good ol' friends at
      Pilani.
    - Always believed organizing events isn't my forte, but,
      helped organize a couple of events at Quark. Feels good.
    - Effective Communication is less about how well you choose
      your words but more about your quantum of concern for the
      other person and the matter at hand!

- Pilani Campus, Love at First sight. Never really felt like
  coming back.
    - The arts/non-technical clubs there are simply superb! We
      have a lot to learn
    - Cycling on campus. A dream come true!
    - All Night Canteen is a real hangout place!
    - Green, Greener, Greenest. Never really felt like we were in
      the deserts of Rajasthan.
    - .... the list can go on and on. I'll stop here.

- FOSS n me.
    - Attended my first FOSS event! The Install Fest @
      Quark. Wasn't as awe inspiring as I would've liked it to be,
      but still a memorable one. Simply for being my first
      install-fest and for the lessons we learnt.
    - FOSSKriti'08 is one event I'll regret missing. It was
      absolutely amazing. I'm just hoping, people here too get to
      that level soon enough.
    - Free Software and Freeware ain't the same stuff. It's
      extremely painful when people address FOSS stuff as
      freeware. Free Software is Software that's Free as in Free
      Speech n Freeware is software that if free as in free beer.
    - Eagerly awaiting mukt.in v2. Can't wait to get back home!
    - Enjoying my time on \#mukt.in and \#linux-india. The new DC
      hub (GNOME) for FOSS junta is cool too!
    - There's an urgent need to start contributing to FOSS. But
      how?

- Haven't yet found myself an intern/project for summer. Wonder
  what's in store, this summer.
- Most of the gang's On-Campus next sem. Will really miss Voodoo
  though. Hoping he has a rocking PS.
- Hoping we won't have to shift hostels next sem.
- Appreciation is a great motivator. Expressing it promptly is
  important. I'm bad at it. Should work on it.
- "The gang" is like a flock of birds in flight.
- This semester is coming to an end already, and I don't have
  anything I'd be proud of.
- Wonder why I have absolutely no feelings about the farewell we'd
  be having soon.
- Awaiting Ugadi Celebs. Seems like they are gonna rock more than
  ever.
- Gone are those days, when I used to post because something I had
  to write about, compelled me to do so. These days, the long
  inactivity on my blog is turning out to be the sole reason for
  my posts. [A few Rare Exceptions though, and this one isn't] I
  wonder if its because life's become uneventful or because I grew
  lazier or because of something else.
- I don't like posting accounts of events from the recent/distant
  past, but I'm doing it just to prevent my blog's death.
