output/posts/post-qwa-post.html
<!DOCTYPE html><html lang="en">
<head>
    
    <meta charset="utf-8">
    <meta name="description" content="">
    <meta name="author" content="punchagan">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Post-Q,W,A Post | Noetic Nought</title>
    
            <link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
    <!--[if lt IE 9]>
    <![endif]-->
            <link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">

    



    
</head>

<body>
    <section class="social">
        <ul>
<!--        <h1 id="blog-title">
            <a href="/" title="Noetic Nought">Noetic Nought</a>
        </h1>
        
         -->
        
            <li><a href="../index.html" title="Home"><i class="icon-home"></i></a></li>
            <li><a href="../archive.html" title="Archives"><i class="icon-folder-open-alt"></i></a></li>
            <li><a href="../categories/index.html" title="Tags"><i class="icon-tags"></i></a></li>
            <li><a href="../rss.xml" title="RSS"><i class="icon-rss"></i></a></li>
            <li><a href="https://twitter.com/punchagan" title="Twitter profile"><i class="icon-twitter"></i></a></li>
            <li><a href="https://github.com/punchagan" title="GitHub profile"><i class="icon-github"></i></a></li>

<!--         -->
        </ul>
    </section>
    <section class="page-content">
        <div class="content" rel="main">
            
    <div class="post">
    
    <h1 class="p-name" itemprop="headline name">Post-Q,W,A Post</h1>

        <div class="meta">
            <div class="authordate">
                <time class="timeago" datetime="2008-03-23T12:17:00">2008-03-23 12:17</time>
            </div>
            

            
          |  
        <a href="post-qwa-post.org" id="sourcelink">Source</a>

            
    <div class="tags">
        <ul>
        More posts about:  
            <li><a class="tag" href="../categories/blab.html">blab</a></li>
            <li><a class="tag" href="../categories/fest.html">fest</a></li>
            <li><a class="tag" href="../categories/quark.html">quark</a></li>
        </ul>
    </div>

        </div>
        <div class="body">
            <p>
Back again with another khichdi of a post.
</p>

<ul class="org-ul">
<li>Quark, Waves and Apogee. [For the uninitiated, Quark is our
technical festival and Waves, our Cul-fest] I had been to
BITS-Pilani, for attending their Tech-fest, Apogee.
<ul class="org-ul">
<li>One would expect Apogee to end up the best, but we were
thoroughly disappointed. It came nowhere near the perfection
of Quark and things seemed quite unprofessional. Hats-off to
Chaitu n others in the Quark Org-Co. I'm already worried
about missing Quark'09 [thanks to my PS]
</li>
<li>The specials at all three events were unforgettable. Feeding
the Fish, the Air Shows (Naval and Amateur planes), the
Orchestral performance, Special Performance [Aasra], Sand
art by Gagan and Mithali!
</li>
<li>Had the opportunity, to meet/have a look at some of the guys
studying at colleges in their home towns. For once, I felt
being in a "reputed", national college does matter.
</li>
<li>Felt good spending some time with good ol' friends at
Pilani.
</li>
<li>Always believed organizing events isn't my forte, but,
helped organize a couple of events at Quark. Feels good.
</li>
<li>Effective Communication is less about how well you choose
your words but more about your quantum of concern for the
other person and the matter at hand!
</li>
</ul>
</li>

<li>Pilani Campus, Love at First sight. Never really felt like
coming back.
<ul class="org-ul">
<li>The arts/non-technical clubs there are simply superb! We
have a lot to learn
</li>
<li>Cycling on campus. A dream come true!
</li>
<li>All Night Canteen is a real hangout place!
</li>
<li>Green, Greener, Greenest. Never really felt like we were in
the deserts of Rajasthan.
</li>
<li>…. the list can go on and on. I'll stop here.
</li>
</ul>
</li>

<li>FOSS n me.
<ul class="org-ul">
<li>Attended my first FOSS event! The Install Fest @
Quark. Wasn't as awe inspiring as I would've liked it to be,
but still a memorable one. Simply for being my first
install-fest and for the lessons we learnt.
</li>
<li>FOSSKriti'08 is one event I'll regret missing. It was
absolutely amazing. I'm just hoping, people here too get to
that level soon enough.
</li>
<li>Free Software and Freeware ain't the same stuff. It's
extremely painful when people address FOSS stuff as
freeware. Free Software is Software that's Free as in Free
Speech n Freeware is software that if free as in free beer.
</li>
<li>Eagerly awaiting mukt.in v2. Can't wait to get back home!
</li>
<li>Enjoying my time on \#mukt.in and \#linux-india. The new DC
hub (GNOME) for FOSS junta is cool too!
</li>
<li>There's an urgent need to start contributing to FOSS. But
how?
</li>
</ul>
</li>

<li>Haven't yet found myself an intern/project for summer. Wonder
what's in store, this summer.
</li>
<li>Most of the gang's On-Campus next sem. Will really miss Voodoo
though. Hoping he has a rocking PS.
</li>
<li>Hoping we won't have to shift hostels next sem.
</li>
<li>Appreciation is a great motivator. Expressing it promptly is
important. I'm bad at it. Should work on it.
</li>
<li>"The gang" is like a flock of birds in flight.
</li>
<li>This semester is coming to an end already, and I don't have
anything I'd be proud of.
</li>
<li>Wonder why I have absolutely no feelings about the farewell we'd
be having soon.
</li>
<li>Awaiting Ugadi Celebs. Seems like they are gonna rock more than
ever.
</li>
<li>Gone are those days, when I used to post because something I had
to write about, compelled me to do so. These days, the long
inactivity on my blog is turning out to be the sole reason for
my posts. [A few Rare Exceptions though, and this one isn't] I
wonder if its because life's become uneventful or because I grew
lazier or because of something else.
</li>
<li>I don't like posting accounts of events from the recent/distant
past, but I'm doing it just to prevent my blog's death.
</li>
</ul>
        </div>
        
    <ul class="pager">
        <li class="previous">
            <a href="gone.html" rel="prev">← Previous post</a>
        </li>
        <li class="next">
            <a href="home-coming.html" rel="next">Next post →</a>
        </li>
    </ul>

            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="rusticreverie",
            disqus_url="http://punchagan.muse-amuse.in/posts/post-qwa-post.html",
        disqus_title="Post-Q,W,A Post",
        disqus_identifier="cache/posts/post-qwa-post.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script>
    <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript>
    <a href="http://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

    </div>

            © 2013
<a href="mailto:punchagan%5B@T%5Dmuse-amuse.in">punchagan</a> -
<a href="http://getnikola.com">Nikola</a> powered -

<a rel="license" href="http://creativecommons.org/licenses/by/3.0/deed.en_US">
Creative Commons Attribution 3.0 Unported License</a>
 -
<a href="http://themes.getnikola.com/#zen">zen</a> theme
            
	

        </div>
    </section>
    
            <script src="../assets/js/all-nocdn.js" type="text/javascript"></script>

    
        <script type="text/javascript">
            $(function(){
                $('.timeago').timeago();
            });
        </script>
    
    <script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-21111013-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>

</body>
</html>